Revit 2023 API
GroupTypeId.FireProtection Property
 "Fire Protection"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public static ForgeTypeId FireProtection { get; }
Visual Basic
Public Shared ReadOnly Property FireProtection As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ FireProtection {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace